sid5291/RL78_uC-OSIII/EvalBoards/Renesas/YRDKRL78G14/IAR/BSP/ior5f100LE.h
#define IICRSV0           IICF0_bit.no0
#define STCEN0            IICF0_bit.no1
#define IICBSY0           IICF0_bit.no6
#define STCF0             IICF0_bit.no7

#define RCLOE1            RTCC0_bit.no5
#define RTCE              RTCC0_bit.no7

#define RWAIT             RTCC1_bit.no0
#define RWST              RTCC1_bit.no1
#define RIFG              RTCC1_bit.no3
#define WAFG              RTCC1_bit.no4
#define WALIE             RTCC1_bit.no6
#define WALE              RTCC1_bit.no7

#define HIOSTOP           CSC_bit.no0
#define XTWKUP            CSC_bit.no5
#define XTSTOP            CSC_bit.no6
#define MSTOP             CSC_bit.no7

#define MCM0              CKC_bit.no4
#define MCS               CKC_bit.no5
#define CSS               CKC_bit.no6
#define CLS               CKC_bit.no7

#define PCLOE0            CKS0_bit.no7

#define PCLOE1            CKS1_bit.no7

#define LVIF              LVIM_bit.no0
#define LVIOMSK           LVIM_bit.no1
#define LVISEN            LVIM_bit.no7

#define LVILV             LVIS_bit.no0
#define LVIMD             LVIS_bit.no7

#define DWAIT0            DMC0_bit.no4
#define DS0               DMC0_bit.no5
#define DRS0              DMC0_bit.no6
#define STG0              DMC0_bit.no7

#define DWAIT1            DMC1_bit.no4
#define DS1               DMC1_bit.no5
#define DRS1              DMC1_bit.no6
#define STG1              DMC1_bit.no7

#define DST0              DRC0_bit.no0
#define DEN0              DRC0_bit.no7

#define DST1              DRC1_bit.no0
#define DEN1              DRC1_bit.no7

#define TMIF05            IF2L_bit.no0
#define TMIF06            IF2L_bit.no1
#define TMIF07            IF2L_bit.no2
#define PIF6              IF2L_bit.no3
#define PIF7              IF2L_bit.no4
#define PIF8              IF2L_bit.no5
#define PIF9              IF2L_bit.no6
#define PIF10             IF2L_bit.no7

#define PIF11             IF2H_bit.no0
#define MDIF              IF2H_bit.no5
#define FLIF              IF2H_bit.no7

#define TMMK05            MK2L_bit.no0
#define TMMK06            MK2L_bit.no1
#define TMMK07            MK2L_bit.no2
#define PMK6              MK2L_bit.no3
#define PMK7              MK2L_bit.no4
#define PMK8              MK2L_bit.no5
#define PMK9              MK2L_bit.no6
#define PMK10             MK2L_bit.no7

#define PMK11             MK2H_bit.no0
#define MDMK              MK2H_bit.no5
#define FLMK              MK2H_bit.no7

#define TMPR005           PR02L_bit.no0
#define TMPR006           PR02L_bit.no1
#define TMPR007           PR02L_bit.no2
#define PPR06             PR02L_bit.no3
#define PPR07             PR02L_bit.no4
#define PPR08             PR02L_bit.no5
#define PPR09             PR02L_bit.no6
#define PPR010            PR02L_bit.no7

#define PPR011            PR02H_bit.no0
#define MDPR0             PR02H_bit.no5
#define FLPR0             PR02H_bit.no7

#define TMPR105           PR12L_bit.no0
#define TMPR106           PR12L_bit.no1
#define TMPR107           PR12L_bit.no2
#define PPR16             PR12L_bit.no3
#define PPR17             PR12L_bit.no4
#define PPR18             PR12L_bit.no5
#define PPR19             PR12L_bit.no6
#define PPR110            PR12L_bit.no7

#define PPR111            PR12H_bit.no0
#define MDPR1             PR12H_bit.no5
#define FLPR1             PR12H_bit.no7

#define WDTIIF            IF0L_bit.no0
#define LVIIF             IF0L_bit.no1
#define PIF0              IF0L_bit.no2
#define PIF1              IF0L_bit.no3
#define PIF2              IF0L_bit.no4
#define PIF3              IF0L_bit.no5
#define PIF4              IF0L_bit.no6
#define PIF5              IF0L_bit.no7

#define CSIIF20           IF0H_bit.no0
#define IICIF20           IF0H_bit.no0
#define STIF2             IF0H_bit.no0
#define CSIIF21           IF0H_bit.no1
#define IICIF21           IF0H_bit.no1
#define SRIF2             IF0H_bit.no1
#define SREIF2            IF0H_bit.no2
#define DMAIF0            IF0H_bit.no3
#define DMAIF1            IF0H_bit.no4
#define CSIIF00           IF0H_bit.no5
#define IICIF00           IF0H_bit.no5
#define STIF0             IF0H_bit.no5
#define CSIIF01           IF0H_bit.no6
#define IICIF01           IF0H_bit.no6
#define SRIF0             IF0H_bit.no6
#define SREIF0            IF0H_bit.no7
#define TMIF01H           IF0H_bit.no7

#define CSIIF10           IF1L_bit.no0
#define IICIF10           IF1L_bit.no0
#define STIF1             IF1L_bit.no0
#define CSIIF11           IF1L_bit.no1
#define IICIF11           IF1L_bit.no1
#define SRIF1             IF1L_bit.no1
#define SREIF1            IF1L_bit.no2
#define TMIF03H           IF1L_bit.no2
#define IICAIF0           IF1L_bit.no3
#define TMIF00            IF1L_bit.no4
#define TMIF01            IF1L_bit.no5
#define TMIF02            IF1L_bit.no6
#define TMIF03            IF1L_bit.no7

#define ADIF              IF1H_bit.no0
#define RTCIF             IF1H_bit.no1
#define ITIF              IF1H_bit.no2
#define KRIF              IF1H_bit.no3
#define TMIF04            IF1H_bit.no7

#define WDTIMK            MK0L_bit.no0
#define LVIMK             MK0L_bit.no1
#define PMK0              MK0L_bit.no2
#define PMK1              MK0L_bit.no3
#define PMK2              MK0L_bit.no4
#define PMK3              MK0L_bit.no5
#define PMK4              MK0L_bit.no6
#define PMK5              MK0L_bit.no7

#define CSIMK20           MK0H_bit.no0
#define IICMK20           MK0H_bit.no0
#define STMK2             MK0H_bit.no0
#define CSIMK21           MK0H_bit.no1
#define IICMK21           MK0H_bit.no1
#define SRMK2             MK0H_bit.no1
#define SREMK2            MK0H_bit.no2
#define DMAMK0            MK0H_bit.no3
#define DMAMK1            MK0H_bit.no4
#define CSIMK00           MK0H_bit.no5
#define IICMK00           MK0H_bit.no5
#define STMK0             MK0H_bit.no5
#define CSIMK01           MK0H_bit.no6
#define IICMK01           MK0H_bit.no6
#define SRMK0             MK0H_bit.no6
#define SREMK0            MK0H_bit.no7
#define TMMK01H           MK0H_bit.no7

#define CSIMK10           MK1L_bit.no0
#define IICMK10           MK1L_bit.no0
#define STMK1             MK1L_bit.no0
#define CSIMK11           MK1L_bit.no1
#define IICMK11           MK1L_bit.no1
#define SRMK1             MK1L_bit.no1
#define SREMK1            MK1L_bit.no2
#define TMMK03H           MK1L_bit.no2
#define IICAMK0           MK1L_bit.no3
#define TMMK00            MK1L_bit.no4
#define TMMK01            MK1L_bit.no5
#define TMMK02            MK1L_bit.no6
#define TMMK03            MK1L_bit.no7

#define ADMK              MK1H_bit.no0
#define RTCMK             MK1H_bit.no1
#define ITMK              MK1H_bit.no2
#define KRMK              MK1H_bit.no3
#define TMMK04            MK1H_bit.no7

#define WDTIPR0           PR00L_bit.no0
#define LVIPR0            PR00L_bit.no1
#define PPR00             PR00L_bit.no2
#define PPR01             PR00L_bit.no3
#define PPR02             PR00L_bit.no4
#define PPR03             PR00L_bit.no5
#define PPR04             PR00L_bit.no6
#define PPR05             PR00L_bit.no7

#define CSIPR020          PR00H_bit.no0
#define IICPR020          PR00H_bit.no0
#define STPR02            PR00H_bit.no0
#define CSIPR021          PR00H_bit.no1
#define IICPR021          PR00H_bit.no1
#define SRPR02            PR00H_bit.no1
#define SREPR02           PR00H_bit.no2
#define DMAPR00           PR00H_bit.no3
#define DMAPR01           PR00H_bit.no4
#define CSIPR000          PR00H_bit.no5
#define IICPR000          PR00H_bit.no5
#define STPR00            PR00H_bit.no5
#define CSIPR001          PR00H_bit.no6
#define IICPR001          PR00H_bit.no6
#define SRPR00            PR00H_bit.no6
#define SREPR00           PR00H_bit.no7
#define TMPR001H          PR00H_bit.no7

#define CSIPR010          PR01L_bit.no0
#define IICPR010          PR01L_bit.no0
#define STPR01            PR01L_bit.no0
#define CSIPR011          PR01L_bit.no1
#define IICPR011          PR01L_bit.no1
#define SRPR01            PR01L_bit.no1
#define SREPR01           PR01L_bit.no2
#define TMPR003H          PR01L_bit.no2
#define IICAPR00          PR01L_bit.no3
#define TMPR000           PR01L_bit.no4
#define TMPR001           PR01L_bit.no5
#define TMPR002           PR01L_bit.no6
#define TMPR003           PR01L_bit.no7

#define ADPR0             PR01H_bit.no0
#define RTCPR0            PR01H_bit.no1
#define ITPR0             PR01H_bit.no2
#define KRPR0             PR01H_bit.no3
#define TMPR004           PR01H_bit.no7

#define WDTIPR1           PR10L_bit.no0
#define LVIPR1            PR10L_bit.no1
#define PPR10             PR10L_bit.no2
#define PPR11             PR10L_bit.no3
#define PPR12             PR10L_bit.no4
#define PPR13             PR10L_bit.no5
#define PPR14             PR10L_bit.no6
#define PPR15             PR10L_bit.no7

